//日结报账管理表格数据
var tableCon1 = {
	"tBody" : [
		["57585177", "2017年09月01日", "0000000000000000", "寿险总公司", "电话销售", "总公司集中代付", "130313888888888888", "李如帅", "补充保障型团体医疗保险", "A031933428849","-","-","银行集中转账","5874.35","人民币","核对通过"],
		["57585177", "2017年09月01日", "0000000000000000", "寿险总公司", "电话销售", "总公司集中代付", "130313888888888888", "李如帅", "补充保障型团体医疗保险", "A031933428849","-","-","银行集中转账","5874","人民币","核对通过"],
		["57585177", "2017年09月01日", "0000000000000000", "寿险总公司", "电话销售", "总公司集中代付", "130313888888888888", "李如帅", "补充保障型团体医疗保险", "A031933428849","-","-","银行集中转账","5874","人民币","核对通过"],
		["57585177", "2017年09月01日", "0000000000000000", "寿险总公司", "电话销售", "总公司集中代付", "130313888888888888", "李如帅", "补充保障型团体医疗保险", "A031933428849","-","-","银行集中转账","5874.35","人民币","核对通过"],
		["57585177", "2017年09月01日", "0000000000000000", "寿险总公司", "电话销售", "总公司集中代付", "130313888888888888", "李如帅", "补充保障型团体医疗保险", "A031933428849","-","-","银行集中转账","5874.35","人民币","核对通过"],
		["57585177", "2017年09月01日", "0000000000000000", "寿险总公司", "电话销售", "总公司集中代付", "130313888888888888", "李如帅", "补充保障型团体医疗保险", "A031933428849","-","-","银行集中转账","5874.35","人民币","核对通过"],
		["57585177", "2017年09月01日", "0000000000000000", "寿险总公司", "电话销售", "总公司集中代付", "130313888888888888", "李如帅", "补充保障型团体医疗保险", "A031933428849","-","-","银行集中转账","5874.35","人民币","核对通过"],
		["57585177", "2017年09月01日", "0000000000000000", "寿险总公司", "电话销售", "总公司集中代付", "130313888888888888", "李如帅", "补充保障型团体医疗保险", "A031933428849","-","-","银行集中转账","5874.35","人民币","核对通过"]
	]
}

//日结影像查询数据
var tableCon2 = {
	"tBody" : [
		["<input type='checkbox' class=''/>", "唐山中支", "20170901", "（被）代付", "总公司收付资金汇总表-被代付-常规业务", "67638.01", "综意险", "已生成", "-", [{"value" : "汇总","name" : "summarizing"}],[{"value":"明细","name":"summarizing"}],"系统生成","人民币",[{
			"value":"确认","name":"sure-button"
		}]],
		["<input type='checkbox'/>", "唐山中支", "20170901", "（被）代付", "总公司收付资金汇总表-被代付-常规业务", "67638.01", "综意险", "已生成", "-", [{"value" : "汇总","name" : "summarizing"}],[{"value":"明细","name":"summarizing"}],"系统生成","人民币",[{
			"value":"确认","name":"sure-button"
		}]],
		["<input type='checkbox'/>", "唐山中支", "20170901", "（被）代付", "总公司收付资金汇总表-被代付-常规业务", "67638.01", "综意险", "已生成", "-", [{"value" : "汇总","name" : "summarizing"}],[{"value":"明细","name":"summarizing"}],"系统生成","人民币",[{
			"value":"确认","name":"sure-button"
		}]]
	]
}

//日结影像监控
var tableCon3 = {
	"tBody" : [
		["1","20170901", "天津分公司", "天津分公司本部", "126", "126", "一致",
		"<a href='javascript:;' class='search'>查询明细</a><a href='javascript:;' class='export'>导出Excel</a>","-","无"
		],
		["2","20170901", "天津分公司", "天津分公司本部", "126", "126", "一致",
		"<a href='javascript:;' class='search'>查询明细</a><a href='javascript:;' class='export'>导出Excel</a>","-","无"
		],
		["3","20170901", "天津分公司", "天津分公司本部", "126", "126", "一致",
		"<a href='javascript:;' class='search'>查询明细</a><a href='javascript:;' class='export'>导出Excel</a>","-","无"
		]
	]
}

//核对报送视图
var tableCon4 = {
	"tBody" : [
		["<input type='checkbox'/>","1","FF系统","20170901","总公司代收付资金汇总表-被代付","15555589.98","17388596","204774","0.00","0.00","0.00","人民币",[{"value":"INC02281762","name":"remedy"}],"6780"],
		["<input type='checkbox'/>","2","FF系统","20170901","总公司代收付资金汇总表-被代付","15555589.98","17388596","204774","0.00","0.00","0.00","人民币",[{"value":"INC02281762","name":"remedy"}],"6780"],
		["<input type='checkbox'/>","3","FF系统","20170901","总公司代收付资金汇总表-被代付","15555589.98","17388596","204774","0.00","0.00","0.00","人民币",[{"value":"INC02281762","name":"remedy"}],"6780"],
		["<input type='checkbox'/>","4","FF系统","20170901","总公司代收付资金汇总表-被代付","15555589.98","17388596","204774","0.00","0.00","0.00","人民币",[{"value":"INC02281762","name":"remedy"}],"6780"]
	]
}

//分公司数据
var tableCon5 = {
	"tBody" : [
		["1","BE123490003","-","-","-","-","199233.00","199233.00","1188.50"],
		["2","BE123490003","-","-","-","-","199233.00","199233.00","1188.50"],
		["3","BE123490003","-","-","-","-","199233.00","199233.00","1188.50"],
		["4","BE123490003","-","-","-","-","199233.00","199233.00","1188.50"]
	]
}

//分公司数据(工单号)
var tableCon6={
	"tBody":[
		["1","FF系统","20170901","总公司代收付资金汇总表-被代付-实时代付","20993838.90","20199.09","920.00","0.00","0.00","0.00","人民币","已报送",[{"value":"INC02281762","name":"remedy"}]],
		["2","综意险系统","20170901","总公司代收付资金汇总表-被代付-实时代付","20993838.90","20199.09","920.00","0.00","0.00","0.00","人民币","已报送",[{"value":"INC02281762","name":"remedy"}]],
		["3","综意险系统","20170901","总公司代收付资金汇总表-被代付-实时代付","20993838.90","20199.09","920.00","0.00","0.00","0.00","人民币","已报送",[{"value":"INC02281762","name":"remedy"}]],
		["4","统一出纳平台","20170901","总公司代收付资金汇总表-被代付-实时代付","20993838.90","20199.09","920.00","0.00","0.00","0.00","人民币","已报送",[{"value":"INC02281762","name":"remedy"}]],
		["5","统一出纳平台","20170901","总公司代收付资金汇总表-被代付-实时代付","20993838.90","20199.09","920.00","0.00","0.00","0.00","人民币","已报送",[{"value":"INC02281762","name":"remedy"}]]
	]
}

//日结监控查询明细数据
var tableCon7={
	"tBody":[
		["1","综意险","给付汇总表-定期给付","1","1"],
		["2","综意险","给付汇总表-定期给付","1","1"],
		["3","综意险","给付汇总表-定期给付","1","1"],
		["4","综意险","给付汇总表-定期给付","1","1"],
		["5","综意险","给付汇总表-定期给付","1","1"],
		["6","综意险","给付汇总表-定期给付","1","1"]
	]
}

//表格赋值
setListTable(tableCon1,"#daily-details");
setListTable(tableCon2,"#daily-image");
setListTable(tableCon3,"#daily-monitoring");
setListTable(tableCon4,"#daily-view");
setListTable(tableCon5,"#data-company");
setListTable(tableCon6,"#data-company-remedy");
setListTable(tableCon7,"#daily-monitoring-data");

$(function(){
//	//调用，模拟select
//	$.setSel(".select_2");
	//弹出历史工单
	$(".remedy").on("click",function(){
		$(".bg_pop,#showPop").show();
		changePage('#boxPanel','pages/historical_work_order.html');
		$(".title_left").html("历史工单信息");
		$("body").css({"overflow":"hidden"});
	});
});
